auto_run/template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          200;
        startFace       179350;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       179550;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          450;
        startFace       179750;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          450;
        startFace       180200;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          90000;
        startFace       180650;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          90000;
        startFace       270650;
    }
)

// ************************************************************************* //
